blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "ADSAD"], ["body", "ASDSADADASDAD"], ["created_at", "2024-04-18 21:36:38.181042"], ["updated_at", "2024-04-18 21:36:38.181042"], ["status", nil]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "ADDASADASDASDSADAD"], ["updated_at", "2024-04-18 21:36:11.264528"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)